[
  {
    "name": "Deploy",
    "description": "The ability is triggered when the card is played."
  },
  {
    "name": "Activate",
    "description": "Trigger the active ability of the card. A card cannot be activated the same turn it was played unless it gains Haste."
  },
  {
    "name": "Reactivate",
    "description": "Re-enable activation of the active ability."
  },
  {
    "name": "Lock",
    "description": "Disable card text. Locked cards are still able to provide protection."
  },
  {
    "name": "Haste",
    "description": "The card can be activated on the turn it is played."
  },
  {
    "name": "Equip",
    "description": "The ability is triggered when the equipment is assigned to a unit."
  },
  {
    "name": "Passive",
    "description": "The ability can be triggered any number of times per turn, while in hand, deck, battlefield, or graveyard."
  },
  {
    "name": "Turnwise",
    "description": "The ability is triggered once per turn, at turn start, while on the battlefield."
  },
  {
    "name": "Play",
    "description": "Move a card from hand to the battlefield, triggering its deploy ability."
  },
  {
    "name": "Resurrect",
    "description": "Play a card from graveyard (instead of from hand)."
  },
  {
    "name": "Tutor",
    "description": "Play a card from deck (instead of from hand)."
  },
  {
    "name": "Destroy",
    "description": "Move a card from battlefield to graveyard, triggering its expire ability."
  },
  {
    "name": "Discard",
    "description": "Move a card from hand or deck to graveyard."
  },
  {
    "name": "Draw",
    "description": "Move a card from the top of deck to hand."
  },
  {
    "name": "Banish",
    "description": "Remove a card from the game, bypassing any reflex or expire abilities."
  },
  {
    "name": "Protect",
    "description": "Prevent a unit from being targeted by hostile abilities (Except Assassination)."
  },
  {
    "name": "Vulnerable",
    "description": "The card cannot receive protection."
  },
  {
    "name": "Deflect",
    "description": "The targeted card no longer protects any units."
  },
  {
    "name": "Assault X",
    "match": "Assault",
    "description": "Destroy a unit of X or less power."
  },
  {
    "name": "Assassinate X",
    "match": "Assassinate",
    "description": "Destroy a unit of X or less power, bypassing Protection."
  },
  {
    "name": "Overkill X",
    "match": "Overkill",
    "description": "Trigger this ability if an assault or assassinate ability exceeds the strength of the target unit by at least X."
  },
  {
    "name": "Seize X",
    "match": "Seize",
    "description": "Move a unit of X or less power to it's opponents battlefield."
  },
  {
    "name": "Armor X",
    "match": "Armor",
    "description": "Added to unit power when calculating vulnerability to Assault, Assassinate, and Seize abilities."
  },
  {
    "name": "Invisible",
    "description": "The unit cannot be targeted by hostile abilities."
  },
  {
    "name": "Reflex",
    "description": "Trigger this ability when an adjacent unit is destroyed."
  },
  {
    "name": "Expire",
    "match": "Expire",
    "description": "Trigger this ability when destroyed."
  },
  {
    "name": "Mana",
    "description": "An elemental resource used to trigger certain abilities."
  },
  {
    "name": "Expend X",
    "match": "Expend",
    "description": "Reroll any X mana dice of the indicated type to trigger the ability."
  },
  {
    "name": "Conjure X",
    "match": "Conjure",
    "description": "Change any X mana dice to the indicated type."
  },
  {
    "name": "Reroll X",
    "match": "Reroll",
    "description": "Reroll any X mana dice of any color."
  },
  {
    "name": "Rally X",
    "match": "Rally",
    "description": "Add the indicated number of points to your score."
  },
  {
    "name": "Rout X",
    "match": "Rout",
    "description": "Subtract the indicated number of points from your score."
  },
  {
    "name": "Finale",
    "description": "Trigger this ability if the card is active at the end of the round."
  },
  {
    "name": "Disloyal",
    "description": "The card is played to the opposite side of the battlefield."
  },
  {
    "name": "Chaos X",
    "match": "Chaos",
    "description": "Trigger this ability if there are at least X unique mana types available."
  },
  {
    "name": "Imbibe",
    "description": "Trigger the ability when a liquor card is equipped to the unit."
  },
  {
    "name": "Bonded",
    "description": "Trigger the ability if you control more than one copy of the card."
  }
]
