[
  {
    "name": "Deploy",
    "description": "The ability is triggered when the card is played."
  },
  {
    "name": "Activate",
    "description": "Trigger the active ability of the card. A card cannot be activated the same turn it was played unless it gains haste."
  },
  {
    "name": "Reactivate",
    "description": "Retrigger the activation ability. The card must not be inactive."
  },
  {
    "name": "Deactivate",
    "description": "Move a card into the inactive position. This disables most abilities (i.e. card text)."
  },
  {
    "name": "Haste",
    "description": "The card can be activated on the turn it is played."
  },
  {
    "name": "Equip",
    "description": "The ability is triggered when the equipment is assigned to a unit. Reserved for equipment cards."
  },
  {
    "name": "Equipped",
    "description": "The ability is triggered (on equipment) as long as the equipment is assigned to a unit, or (on a unit) when the unit has a (sometimes specific) equipment."
  },
  {
    "name": "Passive",
    "description": "The ability is triggered passively, as long as the card is on the battlefield and has not been deactivated."
  },
  {
    "name": "Turnwise",
    "description": "The ability is triggered once per turn, at turn start."
  },
  {
    "name": "Play",
    "description": "Move a card from hand to the battlefield, triggering its deploy ability."
  },
  {
    "name": "Summon",
    "description": "Move a card to the battlefield, bypassing its deploy ability. A card can be summoned from hand, deck, or graveyard."
  },
  {
    "name": "Resurrect",
    "description": "Play a card from graveyard (instead of from hand), triggering its deploy ability."
  },
  {
    "name": "Tutor",
    "description": "Play a card from deck (instead of from hand), triggering its deploy ability. You must shuffle your deck at the start of the round if you tutored any cards in the previous round."
  },
  {
    "name": "Destroy",
    "description": "Move a card from battlefield to graveyard, triggering its expire ability."
  },
  {
    "name": "Discard",
    "description": "Move a card from hand or deck to graveyard."
  },
  {
    "name": "Draw",
    "description": "Move a card from the top of deck to hand."
  },
  {
    "name": "Banish",
    "description": "Remove a card from the game, bypassing any reflex or expire abilities."
  },
  {
    "name": "Protect",
    "description": "When the condition is met, the unit provides protection to an eligible unit, preventing it from being targeted. Deactivation does not break protection."
  },
  {
    "name": "Protector",
    "description": "This card can protect more than one unit at a time."
  },
  {
    "name": "Vulnerable",
    "description": "The card cannot be protected."
  },
  {
    "name": "Deflect",
    "description": "Breaks the protection established between two units."
  },
  {
    "name": "Assault X",
    "description": "Destroy an unprotected unit with X or less power. Multiple assault abilities can be combined on the same turn on the same turn, if the target cannot be slain with a single blow."
  },
  {
    "name": "Assassinate X",
    "description": "Destroy a unit of X or less power, bypassing protection."
  },
  {
    "name": "Overkill X",
    "description": "Trigger this ability if the value of an assault or assassinate move exceeds the point value of the target unit by at least X."
  },
  {
    "name": "Seize X",
    "description": "Move an unprotected unit with X or less power to the opposite side of the battlefield."
  },
  {
    "name": "Armor X",
    "description": "Added to unit power when calculating vulnerability to Assault, Assassinate, and Seize abilities."
  },
  {
    "name": "Invisible",
    "description": "The unit cannot be targeted by hostile abilities."
  },
  {
    "name": "Reflex",
    "description": "Trigger this ability when targeted by another ability."
  },
  {
    "name": "Expire",
    "description": "Trigger this ability when destroyed."
  },
  {
    "name": "Mana",
    "description": "An elemental resource used to trigger certain abilities."
  },
  {
    "name": "Expend X",
    "description": "Reroll X common or personal mana dice of the requisite type in order to trigger the ability."
  },
  {
    "name": "Conjure X",
    "description": "Change X common or personal mana dice to a certain type."
  },
  {
    "name": "Reroll X",
    "description": "Reroll X common or personal mana dice of any color."
  },
  {
    "name": "Rally X",
    "description": "Adds the indicated number of points to the player's score."
  },
  {
    "name": "Rout X",
    "description": "Subtracts the indicated number of points to the player's score. If below zero at the end of a round, the round is automatically lost."
  },
  {
    "name": "Retreat X",
    "description": "Trigger this ability if the player is able to subtract X points from their score."
  },
  {
    "name": "Finale",
    "description": "Trigger this ability if the card is active at the end of the round."
  },
  {
    "name": "Preserve",
    "description": "Prevent a unit from moving to the graveyard at the end of the round."
  },
  {
    "name": "Disloyal",
    "description": "The card is played to the opposite side of the battlefield."
  },
  {
    "name": "Chaos X",
    "description": "Trigger this ability if there are at least X unique mana types available."
  },
  {
    "name": "Imbibe",
    "description": "Trigger the ability when a liquor card is equipped to the unit."
  }
]
